async-await-syntax.org
:PROPERTIES:
:ID:       bc6ba032-8b50-4403-95db-abb7da96ae83
:CREATED:  2024-05-26T22:42:33
:END:
#+title: Implementing ~async~-~await~ syntax using delimited continuations
#+date: <2024-05-26 Sun>
#+LANGUAGE: english
#+PROPERTY: header-args :exports code

When we are writing Haskell code and we need access to weird control operators
(such as ~call/cc~), we usually use the [[https://www.haskellforall.com/2012/12/the-continuation-monad.html][continuation monad]]. Because of Haskell's
~do~ notation, having to write monadic code to get control operators is not so
bad. However, it turns out that if you already have access to some of those
weird control operators, you can get back the syntactic sugar.

I won't go into what the continuation monad is (or why one would want to use
it), but I will talk about the general principle of monads. Here is the
definition of a monad in haskell:

#+begin_src haskell :exports 
class Monad f where
  return :: x -> f x
  bind :: f x -> (x -> f y) -> f y
#+end_src

Monads are useful to model effects. Such an effect can be nondeterminism (the
src_haskell{List} monad), partiality (the src_haskell{Maybe} monad),
statefulness (the src_haskell{State} monad), or even delayed computation (the
src_haskell{Cont} monad). In the above definition, the src_haskell{return}
function would wrap a pure value without effects whereas the src_haskell{bind}
function would thread effectful computations.

* ~async~ and ~await~ in Javascript

One very popular monad (it is very much used outside the functional programming
community) is the concept of promise. A promise is a value that you do not yet
have, but that you want to manipulate. For instance, the javascript
src_js{fetch} function returns promises which you manipulate through the
src_js{.then} method:

#+begin_src js
const resp_promise = fetch("http://example.org/");
resp_promise.then(resp => {
    // Something ...
    // ...
})
#+end_src

As any web developper knows, using src_js{.then} for managing sequential
promises make for very ugly code:

#+begin_src js
const resp_promise = fetch("http://example.org/");
resp_promise.then(resp => {
    // Something ...
    // ...
    something.then(value => {
        // ...
        something_else.then(x => {
            //...
        })
    })
})
#+end_src

Javascript's solution to this problem is ~async~ and ~await~. Using ~await~ on a
promise will make the program look as if it is waiting for the result and ~async~
marks a function in which you would like to use ~await~. It turns out that this
piece of syntactic sugar is the same as the more general ~do~ notation in Haskell.
Because the ~await~ keyword is familiar to many people, I will reuse it as a ~bind~
operator in the rest of the article. Because the ~await~ keyword essentially puts
the delimited continuation from a point to the end of the ~async~ function into
the src_js{.then}, we can recreate the same behaviour by manually capturing this
said delimited continuation.

* The concept of continuation

Before we dive into the technical details of implementing ~async~ / ~await~ syntax,
let me first explain what continuations are. The concept of a continuation
captures the idea of "the rest of the program" from a certain point. Let's say
an interpreter is evaluating the following expression and has just finished
calculating the src_js{b*b - 4 * a * c} sub expression.

#+begin_src js
(-b + sqrt(b*b - 4 * a * c))/(2*a)
#+end_src

The state of the interpreter holds the computed value (the results of evaluating
src_js{b*b - 4 * a * c} ) and what to do with it after. That information is the
continuation. Thinking about continuations is useful for writing compilers, but
it is also useful in other contexts. For instance, there is a certain program
transformation (called Continuation-Passing-Style conversion) where every
src_js{return} keyword is eliminated and where every function call takes a new
parameter, its continuation. For instance, let's CPS-convert the src_js{fib}
function.

#+begin_src js :results output :exports both
function fib(n) {
    if (n <= 1) {
        return n
    } else {
        return fib(n - 1) + fib(n-2);
    }
}

console.log(fib(5))
#+end_src

#+RESULTS:
: 5

It becomes the following:

#+begin_src js :results output :exports both
function fib_cps(n, ret) {
    if (n <= 1) {
        ret(n);
    } else {
        fib_cps(n - 1, r1 => {
            fib_cps(n - 2, r2 => {
                ret(r1 + r2);
            })
        })
    }
}

fib_cps(5, res => {
    console.log(res);
})
#+end_src

#+RESULTS:
: 5

Notice that instead of using src_js{return}, we call a function that is
explicitely passed as a parameter to src_js{fib_cps}. Moreover, each time we
call a function, we must act as if it will never return (it will not) and pass a
handler (a continuation) that contains the rest of the computation. Notice that
in the above code, after having computed the results for \( n - 1 \) and \( n -
2 \), the results is passed to the continuation of the main call which is
src_js{ret}.

While this presentation is quite annoying to write, it lets us add exceptions,
generators and other useful fancy control operators into languages that only
support passing functions around.

* Examples

