async-await-syntax.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="english" xml:lang="english">
<head>
<!-- 2024-09-15 Sun 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Implementing ~async~-~await~ syntax using delimited continuations</title>
<meta name="author" content="Justin Veilleux" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Implementing <code>async</code>-<code>await</code> syntax using delimited continuations</h1>
<p>
When we are writing Haskell code and we need access to weird control operators
(such as <code>call/cc</code>), we usually use the <a href="https://www.haskellforall.com/2012/12/the-continuation-monad.html">continuation monad</a>. Because of Haskell's
<code>do</code> notation, having to write monadic code to get control operators is not so
bad. However, it turns out that if you already have access to some of those
weird control operators, you can get back the syntactic sugar.
</p>

<p>
I won't go into what the continuation monad is (or why one would want to use
it), but I will talk about the general principle of monads. Here is the
definition of a monad in haskell:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #005e8b; font-weight: bold;">class</span> <span style="color: #531ab6; font-weight: bold;">Monad</span> f <span style="color: #005e8b; font-weight: bold;">where</span>
  return <span style="color: #3548cf;">::</span> x <span style="color: #3548cf;">-&gt;</span> f x
  bind <span style="color: #3548cf;">::</span> f x <span style="color: #3548cf;">-&gt;</span> (x <span style="color: #3548cf;">-&gt;</span> f y) <span style="color: #3548cf;">-&gt;</span> f y
</pre>
</div>

<p>
Monads are useful to model effects. Such an effect can be nondeterminism (the
<code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">List</span></code> monad), partiality (the <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Maybe</span></code> monad),
statefulness (the <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">State</span></code> monad), or even delayed computation (the
<code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Cont</span></code> monad). In the above definition, the <code class="src src-haskell">return</code>
function would wrap a pure value without effects whereas the <code class="src src-haskell">bind</code>
function would thread effectful computations.
</p>

<div id="outline-container-orge7ca432" class="outline-2">
<h2 id="orge7ca432"><span class="section-number-2">1.</span> <code>async</code> and <code>await</code> in Javascript</h2>
<div class="outline-text-2" id="text-1">
<p>
One very popular monad (it is very much used outside the functional programming
community) is the concept of promise. A promise is a value that you do not yet
have, but that you want to manipulate. For instance, the javascript
<code class="src src-js">fetch</code> function returns promises which you manipulate through the
<code class="src src-js">.then</code> method:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #005e8b; font-weight: bold;">const</span> <span style="color: #3548cf;">resp_promise</span> = fetch(<span style="color: #a0132f;">"http://example.org/"</span>);
resp_promise.then(resp =&gt; {
    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Something ...</span>
    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">...</span>
})
</pre>
</div>

<p>
As any web developper knows, using <code class="src src-js">.then</code> for managing sequential
promises make for very ugly code:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #005e8b; font-weight: bold;">const</span> <span style="color: #3548cf;">resp_promise</span> = fetch(<span style="color: #a0132f;">"http://example.org/"</span>);
resp_promise.then(resp =&gt; {
    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Something ...</span>
    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">...</span>
    something.then(value =&gt; {
        <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">...</span>
        something_else.then(x =&gt; {
            <span style="color: #595959; font-style: italic;">//</span><span style="color: #595959; font-style: italic;">...</span>
        })
    })
})
</pre>
</div>

<p>
Javascript's solution to this problem is <code>async</code> and <code>await</code>. Using <code>await</code> on a
promise will make the program look as if it is waiting for the result and <code>async</code>
marks a function in which you would like to use <code>await</code>. It turns out that this
piece of syntactic sugar is the same as the more general <code>do</code> notation in Haskell.
Because the <code>await</code> keyword is familiar to many people, I will reuse it as a <code>bind</code>
operator in the rest of the article. Because the <code>await</code> keyword essentially puts
the delimited continuation from a point to the end of the <code>async</code> function into
the <code class="src src-js">.then</code>, we can recreate the same behaviour by manually capturing this
said delimited continuation.
</p>
</div>
</div>

<div id="outline-container-orgd436a64" class="outline-2">
<h2 id="orgd436a64"><span class="section-number-2">2.</span> The concept of continuation</h2>
<div class="outline-text-2" id="text-2">
<p>
Before we dive into the technical details of implementing <code>async</code> / <code>await</code> syntax,
let me first explain what continuations are. The concept of a continuation
captures the idea of "the rest of the program" from a certain point. Let's say
an interpreter is evaluating the following expression and has just finished
calculating the <code class="src src-js">b*b - 4 * a * c</code> sub expression.
</p>

<div class="org-src-container">
<pre class="src src-js">(-b + sqrt(b*b - 4 * a * c))/(2*a)
</pre>
</div>

<p>
The state of the interpreter holds the computed value (the results of evaluating
<code class="src src-js">b*b - 4 * a * c</code> ) and what to do with it after. That information is the
continuation. Thinking about continuations is useful for writing compilers, but
it is also useful in other contexts. For instance, there is a certain program
transformation (called Continuation-Passing-Style conversion) where every
<code class="src src-js"><span style="color: #005e8b; font-weight: bold;">return</span></code> keyword is eliminated and where every function call takes a new
parameter, its continuation. For instance, let's CPS-convert the <code class="src src-js">fib</code>
function.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">fib</span>(<span style="color: #3548cf;">n</span>) {
    <span style="color: #005e8b; font-weight: bold;">if</span> (n &lt;= 1) {
        <span style="color: #005e8b; font-weight: bold;">return</span> n
    } <span style="color: #005e8b; font-weight: bold;">else</span> {
        <span style="color: #005e8b; font-weight: bold;">return</span> fib(n - 1) + fib(n-2);
    }
}

console.log(fib(5))
</pre>
</div>

<pre class="example">
5
</pre>


<p>
It becomes the following:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">fib_cps</span>(<span style="color: #3548cf;">n</span>, <span style="color: #3548cf;">ret</span>) {
    <span style="color: #005e8b; font-weight: bold;">if</span> (n &lt;= 1) {
        ret(n);
    } <span style="color: #005e8b; font-weight: bold;">else</span> {
        fib_cps(n - 1, r1 =&gt; {
            fib_cps(n - 2, r2 =&gt; {
                ret(r1 + r2);
            })
        })
    }
}

fib_cps(5, res =&gt; {
    console.log(res);
})
</pre>
</div>

<pre class="example">
5
</pre>


<p>
Notice that instead of using <code class="src src-js"><span style="color: #005e8b; font-weight: bold;">return</span></code>, we call a function that is
explicitely passed as a parameter to <code class="src src-js">fib_cps</code>. Moreover, each time we
call a function, we must act as if it will never return (it will not) and pass a
handler (a continuation) that contains the rest of the computation. Notice that
in the above code, after having computed the results for \( n - 1 \) and \( n -
2 \), the results is passed to the continuation of the main call which is
<code class="src src-js">ret</code>.
</p>

<p>
While this presentation is quite annoying to write, it lets us add exceptions,
generators and other useful fancy control operators into languages that only
support passing functions around.
</p>
</div>
</div>
