async-await-syntax.org
** Implementing exceptions

#+begin_src js :results output :exports both
let exception_handler = null;

// When implementing try/catch, we want to:
//
// 1. save the current exception handler function
// 2. replace the exception handler function by the one given by the user.
// 3. Execute the thunk with the appropriate continuation
// 4. If throw_exception was called, resume the computation through the `ret` continuation.
function with_exception_handler(thunk, handler, ret) {
    // save the current exception handler
    const old_exception_handler = exception_handler;
    exception_handler = (exn) => {
        // Reinstall the old exception handler
        exception_handler = old_exception_handler;
        handler(exn, ret);
    };
    thunk((thunk_retval) => {
        // Reinstall the old exception handler
        exception_handler = old_exception_handler;
        // and continue the execution through the main continuation
        ret(thunk_retval);
    })
}

// Notice that contrary to every function in CPS, this one doesn't
// have a "continuation" parameter.
function throw_exception(value) {
    // Inside, we just call the exception handler.
    exception_handler(value);
}


function safe_div(num, denum, ret)  {
    if (denum == 0) {
        throw_exception("division by zero")
    } else {
        ret(num/denum)
    }
}


with_exception_handler(
    (ret) => {
        safe_div(0.0, 2.0, (r1) => {
            safe_div(1.0, r1, (r2) => {
                ret(r2);
            })
        })
    },
    (exn, ret) => {
        console.log("got an exception:", exn);
        // We return null to signal it didn't work.
        ret(null)
    },
    (result) => {
        console.log("got result:", result);
    }
)
#+end_src

#+RESULTS:
: got an exception: division by zero
: got result: null

** COMMENT Implementing generators

This one is harder to do, because in addition to doing non local exit (like with
src_js{throw_exception}), we need to resume the generator's continuation.


#+begin_src js
// The function call_generator takes a thunk, a continuation and
// returns a generator object.
function call_generator(thunk, cont) {
    cont(
        
    )
}
#+end_src

** Implementing call/cc

#+begin_src js
function callcc(handler, ret) {
    handler(ret, ret)
}
#+end_src


Implementing src_scheme{call/cc} in CPS is very easy, because CPS exposes every
continuation in an explicit variable. Understanding this control operator,
though, will be useful, because it is often the operator used by languages to
reify continuations and expose them to the user *without forcing them to write
everything in CPS!*

* src_scheme{call/cc} in scheme

The way src_scheme{call/cc} works is that it gives as an argument to the thunk
the function capturing the continuation exiting the block. Let's see how it
works in scheme.

#+begin_src scheme :results output :exports both
(define value
  (call/cc (lambda (ret)
             (display "one\n")
             (display "two\n")
             (ret 12345)
             (display "tree\n")
             (display "four\n"))))

(format #t "value is ~a\n" value)
#+end_src

#+RESULTS:
: one
: two
: value is 12345

Using this primitive, it is possible to do pretty much everything that was
doable in CPS, but without having to actually write CPS code (and endure a
thousand levels of nesting).

** Note

It might be very confusing at first, (because up until now, our use of
continuations have respected scope), but you can reinstall a continuation *after
you have executed it*. This lets you (for instance) do backtracking and other
things.

#+begin_src scheme :results output :exports both
(define kont
  (call/cc (lambda (k) k)))

(display "exited call/cc block\n")

(if (procedure? kont)
    (begin
      (display "hello\n")
      (kont 123))
    (format #t "the value: ~a\n" kont))
#+end_src

#+RESULTS:
: exited call/cc block
: hello
: exited call/cc block
: the value: 123

** Problems with src_scheme{call/cc}

The src_scheme{call/cc} operator, however has flaws. Systems written using this
operator don't compose very well and over the years, proposals have been made
for continuations that don't capture the entirety of program flow. Those
continuations are called delimited.


* Delimited continuations

Delimited continuations are continuations that end with a value, their
reification in functions are more natural because *they are reified into
functions that return something*. Because those continuations don't capture the
entire execution of the program, they play well with each other and with other
constructs. Let's see them in action through the src_scheme{call-with-prompt}
and src_scheme{abort-to-prompt} scheme operators.

