async-await-syntax.html

<div id="outline-container-org93f555d" class="outline-2">
<h2 id="org93f555d"><span class="section-number-2">3.</span> Examples</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd0d8c68" class="outline-3">
<h3 id="orgd0d8c68"><span class="section-number-3">3.1.</span> Implementing exceptions</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #005e8b; font-weight: bold;">let</span> <span style="color: #3548cf;">exception_handler</span> = <span style="color: #531ab6;">null</span>;

<span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">When implementing try/catch, we want to:</span>
<span style="color: #595959; font-style: italic;">//</span>
<span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">1. save the current exception handler function</span>
<span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">2. replace the exception handler function by the one given by the user.</span>
<span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">3. Execute the thunk with the appropriate continuation</span>
<span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">4. If throw_exception was called, resume the computation through the `ret` continuation.</span>
<span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">with_exception_handler</span>(<span style="color: #3548cf;">thunk</span>, <span style="color: #3548cf;">handler</span>, <span style="color: #3548cf;">ret</span>) {
    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">save the current exception handler</span>
    <span style="color: #005e8b; font-weight: bold;">const</span> <span style="color: #3548cf;">old_exception_handler</span> = exception_handler;
    exception_handler = (exn) =&gt; {
        <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Reinstall the old exception handler</span>
        exception_handler = old_exception_handler;
        handler(exn, ret);
    };
    thunk((thunk_retval) =&gt; {
        <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Reinstall the old exception handler</span>
        exception_handler = old_exception_handler;
        <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">and continue the execution through the main continuation</span>
        ret(thunk_retval);
    })
}

<span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Notice that contrary to every function in CPS, this one doesn't</span>
<span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">have a "continuation" parameter.</span>
<span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">throw_exception</span>(<span style="color: #3548cf;">value</span>) {
    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Inside, we just call the exception handler.</span>
    exception_handler(value);
}


<span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">safe_div</span>(<span style="color: #3548cf;">num</span>, <span style="color: #3548cf;">denum</span>, <span style="color: #3548cf;">ret</span>)  {
    <span style="color: #005e8b; font-weight: bold;">if</span> (denum == 0) {
        throw_exception(<span style="color: #a0132f;">"division by zero"</span>)
    } <span style="color: #005e8b; font-weight: bold;">else</span> {
        ret(num/denum)
    }
}


with_exception_handler(
    (ret) =&gt; {
        safe_div(0.0, 2.0, (r1) =&gt; {
            safe_div(1.0, r1, (r2) =&gt; {
                ret(r2);
            })
        })
    },
    (exn, ret) =&gt; {
        console.log(<span style="color: #a0132f;">"got an exception:"</span>, exn);
        <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">We return null to signal it didn't work.</span>
        ret(<span style="color: #531ab6;">null</span>)
    },
    (result) =&gt; {
        console.log(<span style="color: #a0132f;">"got result:"</span>, result);
    }
)
</pre>
</div>

<pre class="example">
got an exception: division by zero
got result: null
</pre>
</div>
</div>

<div id="outline-container-org05cdccc" class="outline-3">
<h3 id="org05cdccc"><span class="section-number-3">3.2.</span> Implementing call/cc</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">callcc</span>(<span style="color: #3548cf;">handler</span>, <span style="color: #3548cf;">ret</span>) {
    handler(ret, ret)
}
</pre>
</div>


<p>
Implementing <code class="src src-scheme">call/cc</code> in CPS is very easy, because CPS exposes every
continuation in an explicit variable. Understanding this control operator,
though, will be useful, because it is often the operator used by languages to
reify continuations and expose them to the user <b>without forcing them to write
everything in CPS!</b>
</p>
</div>
</div>
</div>

<div id="outline-container-orgbfa0bb7" class="outline-2">
<h2 id="orgbfa0bb7"><span class="section-number-2">4.</span> <code class="src src-scheme">call/cc</code> in scheme</h2>
<div class="outline-text-2" id="text-4">
<p>
The way <code class="src src-scheme">call/cc</code> works is that it gives as an argument to the thunk
the function capturing the continuation exiting the block. Let's see how it
works in scheme.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">value</span>
  (<span style="color: #005e8b; font-weight: bold;">call/cc</span> (<span style="color: #005e8b; font-weight: bold;">lambda</span> (ret)
             (display <span style="color: #a0132f;">"one\n"</span>)
             (display <span style="color: #a0132f;">"two\n"</span>)
             (ret 12345)
             (display <span style="color: #a0132f;">"tree\n"</span>)
             (display <span style="color: #a0132f;">"four\n"</span>))))

(format #t <span style="color: #a0132f;">"value is ~a\n"</span> value)
</pre>
</div>

<pre class="example">
one
two
value is 12345
</pre>


<p>
Using this primitive, it is possible to do pretty much everything that was
doable in CPS, but without having to actually write CPS code (and endure a
thousand levels of nesting).
</p>
</div>

<div id="outline-container-org870cd5f" class="outline-3">
<h3 id="org870cd5f"><span class="section-number-3">4.1.</span> Note</h3>
<div class="outline-text-3" id="text-4-1">
<p>
It might be very confusing at first, (because up until now, our use of
continuations have respected scope), but you can reinstall a continuation <b>after
you have executed it</b>. This lets you (for instance) do backtracking and other
things.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">kont</span>
  (<span style="color: #005e8b; font-weight: bold;">call/cc</span> (<span style="color: #005e8b; font-weight: bold;">lambda</span> (k) k)))

(display <span style="color: #a0132f;">"exited call/cc block\n"</span>)

(<span style="color: #005e8b; font-weight: bold;">if</span> (procedure? kont)
    (<span style="color: #005e8b; font-weight: bold;">begin</span>
      (display <span style="color: #a0132f;">"hello\n"</span>)
      (kont 123))
    (format #t <span style="color: #a0132f;">"the value: ~a\n"</span> kont))
</pre>
</div>

<pre class="example">
exited call/cc block
hello
exited call/cc block
the value: 123
</pre>
</div>
</div>

<div id="outline-container-org7404f43" class="outline-3">
<h3 id="org7404f43"><span class="section-number-3">4.2.</span> Problems with <code class="src src-scheme">call/cc</code></h3>
<div class="outline-text-3" id="text-4-2">
<p>
The <code class="src src-scheme">call/cc</code> operator, however has flaws. Systems written using this
operator don't compose very well and over the years, proposals have been made
for continuations that don't capture the entirety of program flow. Those
continuations are called delimited.
</p>
</div>
</div>
</div>


<div id="outline-container-org71b563d" class="outline-2">
<h2 id="org71b563d"><span class="section-number-2">5.</span> Delimited continuations</h2>
<div class="outline-text-2" id="text-5">
<p>
Delimited continuations are continuations that end with a value, their
reification in functions are more natural because <b>they are reified into
functions that return something</b>. Because those continuations don't capture the
entire execution of the program, they play well with each other and with other
constructs. Let's see them in action through the <code class="src src-scheme">call-with-prompt</code>
and <code class="src src-scheme">abort-to-prompt</code> scheme operators.
</p>
</div>
</div>
