async-await-syntax.org
* src_scheme{call-with-prompt} and src_scheme{abort-to-prompt}

In [[https://www.gnu.org/software/guile/][Guile Scheme]], delimited continuations are created through two procedures.

- src_scheme{call-with-prompt} :: You use it together with a special value (a
  tag) to delimit the *end* of the continuation you want to take.
- src_scheme{abort-to-prompt} :: You use it together with the tag to define the
  location at which continuation will *start*.

#+begin_src scheme
(define tag (make-prompt-tag))

(call-with-prompt tag
  (lambda ()
    (let ((x 12345))
      ;; ...
      (let ((y (+ x (abort-to-prompt tag))))
        ;; ...
        y)))
  (lambda (kont)
    ;; ...
    ))
#+end_src

The first argument of src_scheme{call-with-prompt} (the tag) is necessary for
the src_scheme{abort-to-prompt} call to be able to specify which continuation to
open in situations in which multiple src_scheme{call-with-prompt} are nested.
The second argument is a zero argument function (thunk) which will delimit the
end of the captured continuation. When the captured delimited continuation is
called, execution will flow from the src_scheme{abort-to-prompt} call to the end
of this thunk. The third argument is the handler (kind of like ~try~ / ~catch~) that
will be called with the created continuation when src_scheme{abort-to-prompt} is
called. To better understand how it works, here is an example:

#+name: k+5
#+begin_src scheme :exports both :results output
(define tag (make-prompt-tag))
(define cont
  (call-with-prompt tag
    (lambda ()
      (display "hello!\n")
      (let ((x (abort-to-prompt tag "some-value")))
        (+ 5 x)))
    (lambda (k val)
      (format #t "got value: ~s\n" val)
      k)))

(display (cont 1)) (newline)
(display (cont 3)) (newline)
#+end_src

Here is the output of the code:

#+results: k+5
: hello!
: got value: "some-value"
: 6
: 8

At first glance, we can see that, contrary to continuations captured by
src_scheme{call/cc}(which act kind of like value-carrying ~goto~ s), these
delimited continuations return something. Another difference is that in
src_scheme{call/cc}, the ~k~ parameter captures the continuation starting from the
src_scheme{call/cc} call itself, whereas in src_scheme{call-with-prompt} it
captures the continuation starting from the innermost
src_scheme{abort-to-prompt} call inside the thunk.

* ~async~ / ~await~ syntax for any monad

Now that we understand better the concept of continuation, let's use it to
analyze what the src_js{await} keyword does.

One familiar with promises will know that writing this

#+begin_src js :exports code
async function do_something() {

    // Some code before the await

    const x = await returns_promise();

    // Some code after the await

    return y;
}
#+end_src

is equivalent to writing that:

#+begin_src js :exports code
function do_something() {
    // Some code before the await

    returns_promise().then(x => {

        // Some code after the await

        return y;
    })
}
#+end_src

The part that is put in the src_js{.then} (the callback) is actually the
continuation starting from the src_js{await} and ending when the src_js{async}
function ends. If we have some kind of src_js{.then} operator (called ~>>=~ or
~bind~ in Haskell), each time we src_js{await} an effectful value, we can capture
the current delimited continuation (from the src_js{await} to the src_js{async})
and use it as a handler for the value through our ~.then~ function.

Let's use this technique to implement nondeterministic computation.

