async-await-syntax.html

<div id="outline-container-org41ddb65" class="outline-2">
<h2 id="org41ddb65"><span class="section-number-2">6.</span> <code class="src src-scheme">call-with-prompt</code> and <code class="src src-scheme">abort-to-prompt</code></h2>
<div class="outline-text-2" id="text-6">
<p>
In <a href="https://www.gnu.org/software/guile/">Guile Scheme</a>, delimited continuations are created through two procedures.
</p>

<dl class="org-dl">
<dt><code class="src src-scheme">call-with-prompt</code></dt><dd>You use it together with a special value (a
tag) to delimit the <b>end</b> of the continuation you want to take.</dd>
<dt><code class="src src-scheme">abort-to-prompt</code></dt><dd>You use it together with the tag to define the
location at which continuation will <b>start</b>.</dd>
</dl>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">tag</span> (make-prompt-tag))

(<span style="color: #005e8b; font-weight: bold;">call-with-prompt</span> tag
  (<span style="color: #005e8b; font-weight: bold;">lambda</span> ()
    (<span style="color: #005e8b; font-weight: bold;">let</span> ((x 12345))
      <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">...</span>
      (<span style="color: #005e8b; font-weight: bold;">let</span> ((y (+ x (abort-to-prompt tag))))
        <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">...</span>
        y)))
  (<span style="color: #005e8b; font-weight: bold;">lambda</span> (kont)
    <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">...</span>
    ))
</pre>
</div>

<p>
The first argument of <code class="src src-scheme">call-with-prompt</code> (the tag) is necessary for
the <code class="src src-scheme">abort-to-prompt</code> call to be able to specify which continuation to
open in situations in which multiple <code class="src src-scheme">call-with-prompt</code> are nested.
The second argument is a zero argument function (thunk) which will delimit the
end of the captured continuation. When the captured delimited continuation is
called, execution will flow from the <code class="src src-scheme">abort-to-prompt</code> call to the end
of this thunk. The third argument is the handler (kind of like <code>try</code> / <code>catch</code>) that
will be called with the created continuation when <code class="src src-scheme">abort-to-prompt</code> is
called. To better understand how it works, here is an example:
</p>

<div class="org-src-container">
<pre class="src src-scheme" id="org4b986b8">(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">tag</span> (make-prompt-tag))
(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">cont</span>
  (<span style="color: #005e8b; font-weight: bold;">call-with-prompt</span> tag
    (<span style="color: #005e8b; font-weight: bold;">lambda</span> ()
      (display <span style="color: #a0132f;">"hello!\n"</span>)
      (<span style="color: #005e8b; font-weight: bold;">let</span> ((x (abort-to-prompt tag <span style="color: #a0132f;">"some-value"</span>)))
        (+ 5 x)))
    (<span style="color: #005e8b; font-weight: bold;">lambda</span> (k val)
      (format #t <span style="color: #a0132f;">"got value: ~s\n"</span> val)
      k)))

(display (cont 1)) (newline)
(display (cont 3)) (newline)
</pre>
</div>

<p>
Here is the output of the code:
</p>

<pre class="example">
hello!
got value: "some-value"
6
8
</pre>


<p>
At first glance, we can see that, contrary to continuations captured by
<code class="src src-scheme">call/cc</code>(which act kind of like value-carrying <code>goto</code> s), these
delimited continuations return something. Another difference is that in
<code class="src src-scheme">call/cc</code>, the <code>k</code> parameter captures the continuation starting from the
<code class="src src-scheme">call/cc</code> call itself, whereas in <code class="src src-scheme">call-with-prompt</code> it
captures the continuation starting from the innermost
<code class="src src-scheme">abort-to-prompt</code> call inside the thunk.
</p>
</div>
</div>

<div id="outline-container-org2a1cc39" class="outline-2">
<h2 id="org2a1cc39"><span class="section-number-2">7.</span> <code>async</code> / <code>await</code> syntax for any monad</h2>
<div class="outline-text-2" id="text-7">
<p>
Now that we understand better the concept of continuation, let's use it to
analyze what the <code class="src src-js"><span style="color: #005e8b; font-weight: bold;">await</span></code> keyword does.
</p>

<p>
One familiar with promises will know that writing this
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #005e8b; font-weight: bold;">async</span> <span style="color: #005e8b; font-weight: bold;">function</span> do_something() {

    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Some code before the await</span>

    <span style="color: #005e8b; font-weight: bold;">const</span> <span style="color: #3548cf;">x</span> = <span style="color: #005e8b; font-weight: bold;">await</span> returns_promise();

    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Some code after the await</span>

    <span style="color: #005e8b; font-weight: bold;">return</span> y;
}
</pre>
</div>

<p>
is equivalent to writing that:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">do_something</span>() {
    <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Some code before the await</span>

    returns_promise().then(x =&gt; {

        <span style="color: #595959; font-style: italic;">// </span><span style="color: #595959; font-style: italic;">Some code after the await</span>

        <span style="color: #005e8b; font-weight: bold;">return</span> y;
    })
}
</pre>
</div>

<p>
The part that is put in the <code class="src src-js">.then</code> (the callback) is actually the
continuation starting from the <code class="src src-js"><span style="color: #005e8b; font-weight: bold;">await</span></code> and ending when the <code class="src src-js"><span style="color: #005e8b; font-weight: bold;">async</span></code>
function ends. If we have some kind of <code class="src src-js">.then</code> operator (called <code>&gt;&gt;=</code> or
<code>bind</code> in Haskell), each time we <code class="src src-js"><span style="color: #005e8b; font-weight: bold;">await</span></code> an effectful value, we can capture
the current delimited continuation (from the <code class="src src-js"><span style="color: #005e8b; font-weight: bold;">await</span></code> to the <code class="src src-js"><span style="color: #005e8b; font-weight: bold;">async</span></code>)
and use it as a handler for the value through our <code>.then</code> function.
</p>

<p>
Let's use this technique to implement nondeterministic computation.
</p>
</div>
</div>
