async-await-syntax.org
* The src_haskell{List} monad

One way of modeling nondeterministic computation is through lists. Each time we
want to say "this value contains a superposition of many src_haskell{Int}s", we
will say src_haskell{[Int]}. When we want to model a nondeterministic
computation on src_haskell{Int}s (let's say, into strings), we use
src_haskell{Int -> [String]}. we combine those two values through first applying
the function to each possible value (getting a src_haskell{[[String]]}), then by
flattening the lists together into a src_haskell{[String]}. When implemented in
Scheme, it looks like this:

#+caption: For wrapping a determinstic value and for threading a nondeterministic value through a nondeterministic computation.
#+begin_src scheme :session
(define (.then l func)
  (apply append (map func l)))

(define (pure x)
  (list x))
#+end_src

#+RESULTS:
: #<unspecified>

Actually implementing the syntax is slightly more tricky.

#+begin_src scheme :results output :session
(define prompt-tag (make-prompt-tag))

;; Awaiting a value (choosing a value among nondeterministic choices)
;; is simple, just abort to the nearest handler and give the list.
(define (await mval)
  (abort-to-prompt prompt-tag
                   mval))

;; When the continuation is to be threaded using nondeterministic
;; value (a list of things), we use .then on the continuation while
;; making sure we re-delimit the end of the continuation using another
;; async block.
(define (async thunk)
  (call-with-prompt prompt-tag
    thunk
    (lambda (cont value)
      (.then value (lambda (v)
                   (async
                    (lambda ()
                      (cont v))))))))
#+end_src

#+RESULTS:

Finally we can test our code on a toy example. Here, a sequential nondeterminist
choice of number, letter and fruit should yield every combination of number,
letter and fruit.

#+begin_src scheme :session :results output code :exports both
(use-modules (ice-9 pretty-print))

(pretty-print
 (async
  (lambda ()
    (let ((num (await '(1 2 3)))
          (letter (await '(a b c)))
          (fruit (await '("apple" "orange" "banana"))))
      (pure (list num letter fruit))))))
#+end_src

#+RESULTS:
#+begin_src scheme
((1 a "apple")
 (1 a "orange")
 (1 a "banana")
 (1 b "apple")
 (1 b "orange")
 (1 b "banana")
 (1 c "apple")
 (1 c "orange")
 (1 c "banana")
 (2 a "apple")
 (2 a "orange")
 (2 a "banana")
 (2 b "apple")
 (2 b "orange")
 (2 b "banana")
 (2 c "apple")
 (2 c "orange")
 (2 c "banana")
 (3 a "apple")
 (3 a "orange")
 (3 a "banana")
 (3 b "apple")
 (3 b "orange")
 (3 b "banana")
 (3 c "apple")
 (3 c "orange")
 (3 c "banana"))
#+end_src

It works! Note that for the types to work, the output of every src_js{async}
thunk must be wrapped into a monadic value. You do not have to do this when
using Javascript promises simply because it is done automatically. Note that you
can use the exact same code for every monad, just change the definition of
src_scheme{.then} and src_scheme{pure}. You can use this code to ease the
implementation of monadic parser combinators, promises (which is just, as we
have seen, continuation passing style) and other effects.


