async-await-syntax.html

<div id="outline-container-org3e6766a" class="outline-2">
<h2 id="org3e6766a"><span class="section-number-2">8.</span> The <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">List</span></code> monad</h2>
<div class="outline-text-2" id="text-8">
<p>
One way of modeling nondeterministic computation is through lists. Each time we
want to say "this value contains a superposition of many <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Int</span></code>s", we
will say <code class="src src-haskell">[<span style="color: #531ab6; font-weight: bold;">Int</span>]</code>. When we want to model a nondeterministic
computation on <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Int</span></code>s (let's say, into strings), we use
<code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Int</span> <span style="color: #3548cf;">-&gt;</span> [<span style="color: #531ab6; font-weight: bold;">String</span>]</code>. we combine those two values through first applying
the function to each possible value (getting a <code class="src src-haskell">[[<span style="color: #531ab6; font-weight: bold;">String</span>]]</code>), then by
flattening the lists together into a <code class="src src-haskell">[<span style="color: #531ab6; font-weight: bold;">String</span>]</code>. When implemented in
Scheme, it looks like this:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>For wrapping a determinstic value and for threading a nondeterministic value through a nondeterministic computation.</label><pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">define</span> (<span style="color: #8f0075;">.then</span> l func)
  (apply append (<span style="color: #005e8b; font-weight: bold;">map</span> func l)))

(<span style="color: #005e8b; font-weight: bold;">define</span> (<span style="color: #8f0075;">pure</span> x)
  (list x))
</pre>
</div>

<p>
Actually implementing the syntax is slightly more tricky.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">prompt-tag</span> (make-prompt-tag))

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Awaiting a value (choosing a value among nondeterministic choices)</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">is simple, just abort to the nearest handler and give the list.</span>
(<span style="color: #005e8b; font-weight: bold;">define</span> (<span style="color: #8f0075;">await</span> mval)
  (abort-to-prompt prompt-tag
                   mval))

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">When the continuation is to be threaded using nondeterministic</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">value (a list of things), we use .then on the continuation while</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">making sure we re-delimit the end of the continuation using another</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">async block.</span>
(<span style="color: #005e8b; font-weight: bold;">define</span> (<span style="color: #8f0075;">async</span> thunk)
  (<span style="color: #005e8b; font-weight: bold;">call-with-prompt</span> prompt-tag
    thunk
    (<span style="color: #005e8b; font-weight: bold;">lambda</span> (cont value)
      (.then value (<span style="color: #005e8b; font-weight: bold;">lambda</span> (v)
                   (async
                    (<span style="color: #005e8b; font-weight: bold;">lambda</span> ()
                      (cont v))))))))
</pre>
</div>

<p>
Finally we can test our code on a toy example. Here, a sequential nondeterminist
choice of number, letter and fruit should yield every combination of number,
letter and fruit.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (ice-9 pretty-print))

(pretty-print
 (async
  (<span style="color: #005e8b; font-weight: bold;">lambda</span> ()
    (<span style="color: #005e8b; font-weight: bold;">let</span> ((num (await '(1 2 3)))
          (letter (await '(a b c)))
          (fruit (await '(<span style="color: #a0132f;">"apple"</span> <span style="color: #a0132f;">"orange"</span> <span style="color: #a0132f;">"banana"</span>))))
      (pure (list num letter fruit))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">((1 a <span style="color: #a0132f;">"apple"</span>)
 (1 a <span style="color: #a0132f;">"orange"</span>)
 (1 a <span style="color: #a0132f;">"banana"</span>)
 (1 b <span style="color: #a0132f;">"apple"</span>)
 (1 b <span style="color: #a0132f;">"orange"</span>)
 (1 b <span style="color: #a0132f;">"banana"</span>)
 (1 c <span style="color: #a0132f;">"apple"</span>)
 (1 c <span style="color: #a0132f;">"orange"</span>)
 (1 c <span style="color: #a0132f;">"banana"</span>)
 (2 a <span style="color: #a0132f;">"apple"</span>)
 (2 a <span style="color: #a0132f;">"orange"</span>)
 (2 a <span style="color: #a0132f;">"banana"</span>)
 (2 b <span style="color: #a0132f;">"apple"</span>)
 (2 b <span style="color: #a0132f;">"orange"</span>)
 (2 b <span style="color: #a0132f;">"banana"</span>)
 (2 c <span style="color: #a0132f;">"apple"</span>)
 (2 c <span style="color: #a0132f;">"orange"</span>)
 (2 c <span style="color: #a0132f;">"banana"</span>)
 (3 a <span style="color: #a0132f;">"apple"</span>)
 (3 a <span style="color: #a0132f;">"orange"</span>)
 (3 a <span style="color: #a0132f;">"banana"</span>)
 (3 b <span style="color: #a0132f;">"apple"</span>)
 (3 b <span style="color: #a0132f;">"orange"</span>)
 (3 b <span style="color: #a0132f;">"banana"</span>)
 (3 c <span style="color: #a0132f;">"apple"</span>)
 (3 c <span style="color: #a0132f;">"orange"</span>)
 (3 c <span style="color: #a0132f;">"banana"</span>))
</pre>
</div>

<p>
It works! Note that for the types to work, the output of every <code class="src src-js"><span style="color: #005e8b; font-weight: bold;">async</span></code>
thunk must be wrapped into a monadic value. You do not have to do this when
using Javascript promises simply because it is done automatically. Note that you
can use the exact same code for every monad, just change the definition of
<code class="src src-scheme">.then</code> and <code class="src src-scheme">pure</code>. You can use this code to ease the
implementation of monadic parser combinators, promises (which is just, as we
have seen, continuation passing style) and other effects.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-05-26 Sun 00:00</p>
<p class="author">Author: Justin Veilleux</p>
<p class="date">Created: 2024-09-15 Sun 21:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
